package b_Gaishu.cn;

public class gaisu {

	/*
	内部类概述：
	                    把类定义在其他类的内部，这个类就被成为内部类
	内部类访问特点：
	      A:内部类可以直接访问外部类的成员，包括私有
	      B:外部类要访问内部类的成员，必须创建对象
          内部类位置：
                           成员位置：在成员位置定义的类，被称为成员内部类
       	局部位置：在局部位置定义的类，被称为局部内部类
       	
     成员内部类：
       如何直接访内部类的成员：？？？ 
        	外部类名.内部类名  对象名=外部类对象.内部类对象；
  
	     成员内部类的修饰符：
	     private：为了保证数据的安全性
	     static：为了方便访问数据
	     注意：静态内部类访问外部类数据必须用静态修饰符 
       注意：1、内部类和外部类没有继承关系    
	   2、通过外部类名限定this对象
	    outer.this
	    
	局部内部类：
	A：可以直接访问外部类的成员
	B：在局部位置，可以创建内部类对象，通过对象调用内部类方法，来使用局部内部类功能    
	*/
	
	
	
	
}
